
import { GeneralService } from './general.service';

      
   
     export const TREE_DATA = [
        {
          name: 'ש"ס',
          children: [
            {name: 'זרעים',
            children: [
              {name: 'ברכות'}
            ]
          },
          {name: 'מועד',
            children: [
              {name: 'שבת'},
              {name: 'עירובין'},
              {name: 'פסחים'},
              {name: 'שקלים'},
              {name: 'ראש השנה'},
              {name: 'יומא'},
              {name: 'סוכה'},
              {name: 'ביצה'},
              {name: 'תענית'},
              {name: 'מגילה'},
              {name: 'מועד קטן'},
              {name: 'חגיגה'}
            ]
          },
          {name: 'נשים',
            children: [
              {name: 'יבמות'},
              {name: 'כתובות'},
              {name: 'נדרים'},
              {name: 'נזיר'},
              {name: 'סוטה'},
              {name: 'גיטין'},
              {name: 'קידושין'},
            ]
          },
          {name: 'נזיקין',
            children: [
              {name: 'בבא קמא'},
              {name: 'בבא מציעא'},
              {name: 'בבא בתרא'},
              {name: 'סנהדרין'},
              {name: 'מכות'},
              {name: 'שבועות'},
              {name: 'עבודה זרה'},
              {name: 'הוריות'},
            ]
          },
          ]
        }, {
          name: 'הלכה',
          children: [
            {
              name: 'טור ובית יוסף',
              children: [
                {name: 'טור אורח חיים'},
                {name: 'טור יורה דעה'},
                {name: 'טור אבן העזר'},
                {name: 'טור חושן משפט'},
              ]
            }, {
              name: 'שולחן ערוך',
              children: [
                {name: 'אורח חיים'},
                {name: 'יורה דעה'},
                {name: 'אבן העזר'},
                {name: 'חושן משפט'},
              ]
            },
          ]
        },
      ];     

      export const pages = [
          "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט","י",
          "יא", "יב", "יג", "יד", "טו", "טז", "יז", "יח", "יט",
           "כ", "כא", "כב", "כג", "כד", "כה", "כו", "כז", "כח", "כט",
           "ל", "לא", "לב", "לג", "לד", "לה", "לו", "לז", "לח", "לט",
           "מ", "מא", "מב", "מג", "מד", "מה", "מו", "מז", "מח", "מט",
           "נ", "נא", "נב", "נג", "נד", "נה", "נו", "נז", "נח", "נט",
           "ס", "סא", "סב", "סג", "סד", "סה", "סו", "סז", "סח", "סט",
           "ע", "עא", "עב", "עג", "עד", "עה", "עו", "עז", "עח", "עט",
           "פ", "פא", "פב", "פג", "פד", "פה", "פו", "פז", "פח", "פט",
           "צ", "צא", "צב", "צג", "צד", "צה", "צו", "צז", "צח", "צט",
           "ק", "קא", "קב", "קג", "קד", "קה", "קו", "קז", "קח", "קט",
           "קי", "קיא", "קיב", "קיג", "קיד", "קטו", "קטז", "קיז", "קיח", "קיט",
           "קכ", "קכא", "קכב", "קכג", "קכד", "קכה", "קכו", "קכז", "קכח", "קכט",
           "קל", "קלא", "קלב", "קלג", "קלד", "קלה", "קלו", "קלז", "קלח", "קלט",
           "קמ", "קמא", "קמב", "קמג", "קמד", "קמה", "קמו", "קמז", "קמח", "קמט",
           "קנ", "קנא", "קנב", "קנג", "קנד", "קנה", "קנו", "קנז", "קנח", "קנט",
           "קס", "קסא", "קסב", "קסג", "קסד", "קסה", "קסו", "קסז", "קסח", "קסט",
           "קע", "קעא", "קעב", "קעג", "קעד", "קעה", "קעו", "קעז"
      ]


  

      

